Revit 2026 API

# DimensionShape Enumeration

---

An enumerated type to list dimension type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DimensionShape
```
```vb
Public Enumeration DimensionShape
```
```cpp
public enum class DimensionShape
```
```fsharp
type DimensionShape
```

| Member name | Value | Description |
| --- | --- | --- |
| Angular | 1 | Angular dimension. |
| ArcLength | 3 | ArcLength dimension. |
| Diameter | 5 | Diameter dimension. |
| Linear | 0 | Linear dimension. |
| Radial | 2 | Radial dimension. |
| Spot | 4 | Spot dimension. |
| Unknown | 6 | Unknown type dimension. |

#### Reference

Autodesk.Revit.DB Namespace